nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/driver_examples/lpcmp/round_robin/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
 
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/
#include "fsl_common.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitLpcmpPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{

}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    const siul2_pin_settings_t pin_pte3_config =
    {
         .base                        = SIUL2,
         .pinPortIdx                  = 131u,
         .mux                         = kPORT_MUX_AS_GPIO,
         .safeMode                    = kPORT_SAFE_MODE_DISABLED,
         .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
         .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
         .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
         .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
         .invert                      = kPORT_INVERT_DISABLED,
         .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
         .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,
         .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
         .inputMuxReg                 = {
                                          192u
                                        },
         .inputMux                    = { 
                                          kPORT_INPUT_MUX_ALT1,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT,
                                          kPORT_INPUT_MUX_NO_INIT
                                        },
         .initValue                   = 2u
     };
    SIUL2_PinInit(&pin_pte3_config);
    
    
    const siul2_pin_settings_t pin_pte14_config =
     {
         .base                        = SIUL2,
         .pinPortIdx                  = 142u,
         .mux                         = kPORT_MUX_ALT4,
         .safeMode                    = kPORT_SAFE_MODE_DISABLED,
         .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
         .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
         .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
         .invert                      = kPORT_INVERT_DISABLED,
         .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
         .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
         .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
         .initValue                   = 2u
     };
     SIUL2_PinInit(&pin_pte14_config);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLpcmpPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLpcmpPins(void)
{
    const  siul2_pin_settings_t pin_pta0_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 0u,
        .mux                         = kPORT_MUX_ALT1,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,

        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_pta0_config);
    
    const  siul2_pin_settings_t pin_pta1_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 1u,
        .mux                         = kPORT_MUX_ALT1,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,

        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_pta1_config);
    
    const  siul2_pin_settings_t pin_pta2_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 2u,
        .mux                         = kPORT_MUX_ALT1,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,

        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_pta2_config);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
